Revit 2027 API
BuiltInFailures.ConstraintFailures.UndeletedConstraints Property
 A dimension that has lock constraints is being deleted, but the elements will still be constrained. Push "Unconstrain" to remove the constraints or "OK" to leave elements constrained..
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UndeletedConstraints { get; }
Public Shared ReadOnly Property UndeletedConstraints As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UndeletedConstraints {
	FailureDefinitionId^ get ();
}
static member UndeletedConstraints : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ConstraintFailures Class
Autodesk.Revit.DB Namespace